Tekla.Structures.Model.Model.GetConnectionStatus
Returns true if a proper connection to the Tekla Structures process has been established. If, for some reason, the connection
has been lost, the method will return false. Currently, there's no way to re-establish the connection.
Returns: True on success.

Tekla.Structures.Model.Model.SelectModelObject(Tekla.Structures.Identifier)
Takes as input an identifier to an object and then checks its type and
instantiates and selects it before returning it.
ID: The identifier of the model object that is to be selected.
Returns: The selected model object with the given identifier.

Tekla.Structures.Model.Model.CommitChanges
Commits the changes made to the model database so far. One commit is something that a
user can later on undo with the undo command. A commit also launches the drawing of the
changed product model to the visible views. A dependent plug-in should never call CommitChanges,
since this would make undo very difficult for the user to do. However, non-dependent plug-ins
require a separate commit if new objects are created.
Returns: True on success.